Revit 2027 API
PipePressureDropData.ReynoldsNumber Property
 The reynolds number of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ReynoldsNumber { get; set; }
Public Property ReynoldsNumber As Double
	Get
	Set
public:
property double ReynoldsNumber {
	double get ();
	void set (double value);
}
member ReynoldsNumber : float with get, set
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace